# list로 구현
# 첫 시작 arr = [5]를 만들어서 다음 커질 수를 만들기 위한 초기 배열 생성
# x*10 : 0붙이기
# x*10+5 : 5붙이기

def solution(l, r):
    answer = []
    # 0과 5로 이루어진 숫자를 만들어 저장할 리스트 생성
    # 처음 숫자는 5부터 시작
    arr = [5]
    # 생성 리스트에서 현재 확인할 위치를 나타내는 인덱스 i를 0으로 설정
    i = 0
    # 생성 리스트에서 아직 확인하지 않은 숫자가 남아 있는 동안 반복
    while i < len(arr):
        # 생성 리스트의 i번째 숫자를 현재 숫자로 가져오기
        num = arr[i]
        # 현재 숫자가 l 이상 r 이하라면 정답리스트에 추가
        if l <= num <= r:
            answer.append(num)
        # 현재 숫자의 뒤에서 0을 붙인 새로운 숫자 만들기
        n1 = num*10
        # 현재 숫자의 뒤에 5를 붙인 새로운 숫자 만들기
        n2 = num*10+5
        # 0을 붙인 숫자가 r 이하라면 생성리스트에 추가
        if n1 <= r:
            arr.append(n1)
        # 5를 붙인 숫자가 r 이하라면 생성리스트에 추가
        if n2 <= r:
            arr.append(n2)
        i += 1  
    return answer if answer else [-1]